In [10]:
import pandas as pd

df = pd.read_excel("../data/raww_hr_analytics_data.xlsx")


# Đọc tất cả sheet vào một dictionary
xls = pd.read_excel("../data/raww_hr_analytics_data.xlsx", sheet_name=None)  # sheet_name=None => tất cả sheet
print(xls.keys())  # xem tên các sheet

dict_keys(['Employees', 'Absences', 'Performance', 'Recruitment', 'Training'])

In [13]:
df_employee = xls['Employees']
df_absence = xls['Absences']
df_performance = xls['Performance']
df_recruitment = xls['Recruitment']
df_training = xls['Training']

In [14]:
df_employee.head()

,employee_id,full_name,department,position,location,hire_date,termination_date,termination_reason,salary,age,gender,is_active
0,EMP0001,Nhân viên 1,HR,Manager,Đà Nẵng,2023-11-24,NaT,NaN,45054301,36,Nam,True
1,EMP0002,Nhân viên 2,Operations,Director,Hà Nội,2023-12-13,2024-05-02,Sa thải,82953410,49,Nam,False
2,EMP0003,Nhân viên 3,Finance,Manager,TP.HCM,2023-09-16,NaT,NaN,49006407,56,Nữ,True
3,EMP0004,Nhân viên 4,Sales,Manager,TP.HCM,2023-10-29,NaT,NaN,48856417,49,Nữ,True
4,EMP0005,Nhân viên 5,Customer Service,Junior,Hà Nội,2023-04-21,NaT,NaN,13778008,46,Nam,True

In [15]:
df_absence.head()

  employee_id absence_date  absence_type  approved
0     EMP0002   2024-02-04      Thai sản      True
1     EMP0002   2024-02-04       Đào tạo      True
2     EMP0002   2024-02-23  Việc cá nhân      True
3     EMP0002   2024-02-22        Ốm đau      True
4     EMP0002   2024-02-22        Ốm đau      True

In [17]:
df_performance.head()

,employee_id,review_period,review_date,performance_score,goals_met,reviewer_id,completed_on_time
0,EMP0002,Q4/2023,2023-12-28,2.2,True,MGR013,False
1,EMP0002,Q1/2024,2024-03-28,1.5,False,MGR001,True
2,EMP0010,Q4/2023,2023-12-28,2.9,True,MGR017,True
3,EMP0010,Q1/2024,2024-03-28,2.8,True,MGR002,False
4,EMP0010,Q2/2024,2024-06-28,1.3,True,MGR009,True

In [18]:
df_recruitment.head()

,job_id,department,position,job_posted_date,filled_date,days_to_fill,internal_recruiting_cost,external_recruiting_cost,total_applicants,interviewed,hired_employee_id
0,JOB0001,Sales,Director,2024-03-25,2024-05-07,NaN,3420365,9839871,95,11,EMP0106
1,JOB0002,Finance,Manager,2024-07-19,NaT,80.0,3416436,5458858,34,3,EMP0422
2,JOB0003,Finance,Intern,2023-01-27,2023-03-30,62.0,3704069,9728448,68,12,NaN
3,JOB0004,Sales,Manager,2023-05-03,NaT,NaN,5626109,13275454,95,6,NaN
4,JOB0005,HR,Junior,2023-03-22,2023-07-10,110.0,3865976,17203102,68,19,EMP0038

In [19]:
df_training.head()

,employee_id,training_program,training_date,duration_hours,cost,completed,satisfaction_score
0,EMP0002,Tuân thủ pháp luật,2024-04-11,40,2864909,True,4.6
1,EMP0010,Quản lý dự án,2024-02-24,33,1669519,True,3.7
2,EMP0019,Tuân thủ pháp luật,2023-07-21,39,5105861,True,4.5
3,EMP0019,Tuân thủ pháp luật,2023-11-12,29,8556058,True,4.4
4,EMP0027,Tin học văn phòng,2023-07-24,26,7446253,True,3.5